{
  "intro1": {
    "message": "Welcome to the finest shop in all of La Harpar!",
    "opt1": "Isn't this the only shop in town?"
  },
  "intro2": {
    "message": "Well, yes... and that is exactly what makes it the best!",
    "opt1": "Fair point. What are you selling?"
  },
  "intro3": {
    "message": "All sorts of goods! Materials, food, equipment, and any essentials you might need during your travels.",
    "opt1": "Let's see what you've got then."
  },
  "default": {
    "message": "Looking to trade, are we?",
    "opt1": "Your basement is officially rat-free. I think I need a bath, though.",
    "opt2": "Let me see your wares.",
    "opt3": "Tell me a bit about yourself.",
    "opt4": "What can you tell me about La Harpar?",
    "opt5": "Are there any people here I should meet?",
    "opt6": "Do you need help with anything?"
  },
  "aboutMe": {
    "message": "I'm La Harpar's most charismatic trader! Born and raised right here in this village.",
    "opt1": "What's it like living here? Anything interesting to do?",
    "opt2": "You must know everyone in town, then?"
  },
  "aboutLiving": {
    "message": "It's a quiet life, mostly. Other than the crab infestation on the beach. I heard Josh is looking for someone to help thin them out.",
    "opt1": "I'll go look for him."
  },
  "aboutVillage": {
    "message": "La Harpar is the largest fish exporter in Port Stocksmar. Our fishermen are famous across all four regions, aye.",
    "opt1": "What makes them so famous?",
    "opt2": "I've heard enough for now."
  },
  "aboutFishermen": {
    "message": "Our waters hold the highest quality fish, and our fishermen are experts with decades of experience. This village has been a vital partner to North Lirold for a long time.",
    "opt1": "So the fish are doing all the heavy lifting? I see."
  },
  "aboutFishQuality": {
    "message": "The quality of the fish is vital, of course, but it takes a great deal of skill to catch and prepare them properly!",
    "opt1": "Fair enough. Let me ask you something else."
  },
  "aboutPeople": {
    "message": "There's Josh at the tavern; he's a good soul but leans a bit too hard on the bottle. The bartender is always swamped, so he's likely looking for help. And Marvin just returned from an expedition—you'll find him near the guild.",
    "opt1": "The guild?"
  },
  "aboutGuild": {
    "message": "The Exploration Guild. It's the main hub for local adventurers. You should pay them a visit; they'll help you get prepared for the road.",
    "opt1": "I'll definitely head over there.",
    "opt2": "I don't need a guild. I can handle myself just fine."
  },
  "aboutDanger": {
    "message": "Confident, aye? I like that. Just stay sharp—the wildlife around here can be quite unforgiving.",
    "opt1": "Thanks for the warning."
  },
  "questOffer": {
    "message": "Actually, aye. I've got a nasty rat problem in the basement. Clear them out for me, and I'll make sure it's worth your while.",
    "opt1": "Rats? Should be easy enough.",
    "opt2": "No thanks. I don't do basements."
  },
  "questCompleted": {
    "message": "No help needed at the moment! I'm busy moving my merchandise back into the cellar.",
    "opt1": "Alright, see you later."
  }
}
